{
  "type": "issue",
  "issue": {
    "id": 899125286,
    "node_id": "MDU6SXNzdWU4OTkxMjUyODY=",
    "url": "https://api.github.com/repos/bitcoin/bitcoin/issues/22028",
    "repository_url": "https://api.github.com/repos/bitcoin/bitcoin",
    "labels_url": "https://api.github.com/repos/bitcoin/bitcoin/issues/22028/labels%7B/name%7D",
    "comments_url": "https://api.github.com/repos/bitcoin/bitcoin/issues/22028/comments",
    "events_url": "https://api.github.com/repos/bitcoin/bitcoin/issues/22028/events",
    "html_url": "https://github.com/bitcoin/bitcoin/issues/22028",
    "number": 22028,
    "state": "closed",
    "state_reason": "completed",
    "title": "CVE-2021-31876 is Not a Vulnerability ",
    "body": "I'm 98% certain that whomever submitted this CVE (Core devs?) erroneously reported that the protocol was not properly ejecting transactions from the mempool based on certain pre-coded conditions dictated by BIP125. \r\n\r\nI went through the protocol documentation (referencing 'Mastering Bitcoin' and relevant accompanying code), and will confirm in this post that the protocol is actually behaving the way that it should in the example scenario outlined in the CVE. \r\n\r\n### Quick Look at CVE-2021-31876\r\n\r\nYou can find the URL to that CVE here: <<https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-31876>>\r\n\r\nBelow is the full text of the CVE: \r\n\r\n> *\"Bitcoin Core 0.12.0 through 0.21.1 does not properly implement the replacement policy specified in BIP125, which makes it easier for attackers to trigger a loss of funds, or a denial of service attack against downstream projects such as Lightning network nodes. An unconfirmed child transaction with nSequence = 0xff_ff_ff_ff, spending an unconfirmed parent with nSequence <= 0xff_ff_ff_fd, should be replaceable because there is inherited signaling by the child transaction. However, the actual PreChecks implementation does not enforce this. Instead, mempool rejects the replacement attempt of the unconfirmed child transaction.\"* \r\n\r\nThat paragraph is a bit dense, so let's \"humanize\" the situation a bit by creating a mock situation involving you and your friends (Johnny and Amy):\r\n\r\n1. When you send a normal Bitcoin transaction, the \"parent\" is the transaction you received that gave you the balance necessary to be able to send that TX. \r\n\r\n2. Let's say Johnny sends you 1 Bitcoin because he's a great friend. You now have 1 BTC (you had absolutely nothing before - so Johnny blesed you)\r\n\r\n3. But you owe Amy money - specifically, 1 Bitcoin (life sucks). So you send 1 BTC to Amy. \r\n\r\n**At this point, two transactions have occurred**: \r\n\r\na) Johnny sent you 1 BTC (**parent**)\r\n\r\n**then**\r\n\r\nb) You sent Amy 1 (**child**) \r\n\r\nNow to understand the concept being outlined in the CVE, let's revise our scenario slightly. \r\n\r\n1. Let's say Johnny is lazy but he trusts you with his life because you're an honest, upstanding person. So Johnny hits you up and says, \"Dude here's my private key, just send yourself 1 BTC\". You say, 'Okay Johnny!' \r\n\r\n2. Using Johnny's wallet, you sign a transaction to yourself. \r\n\r\n3. But you **decide not to broadcast that signed transaction immediately**. You save it in a document on your desktop or something. \r\n\r\n4. You still owe Amy in this scenario (sorry!) and she still wants her money...or else. So you create your 1 BTC transaction to Amy. \r\n\r\n5. You use that signed transaction from Johnny as the input for your transaction to Amy. Even though you haven't broadcasted it yet, you still have all of the necessary information to craft such a transaction. \r\n\r\nThis transaction is actually considered **valid** and **standard**. \r\n\r\n> *Why?* \r\n\r\nBecause the process of creating transactions is not interactive. In other words, you can craft a transaction entirely offline (assuming you have the knowledge of the necessary inputs for the transaction etc.). \r\n\r\nThere are no checks in Bitcoin that determines whether a transaction is valid or not on the basis of whether it has been included in the chain or not. Instead, Bitcoin assesses whether you have met the necessary conditions to spend a transaction (i.e. ,SHA256+ripemd160(pubkey) & match that with the byte push, run the rest of the stack and validate the signature correlates with the raw Bitcoin pubkey you submitted as an input to the stack). \r\n\r\nIn this example, the transaction you're broadcasting is technically valid because you used Johnny's wallet to sign the 1 BTC over to you. And when you crafted  your TX to Amy, you used that same signed transaction as the input to your transaction to her. \r\n\r\nOnly issue here though is that Johnny's TX was never broadcasted, so even though the transaction is validly constructed - its referring to a transaction that does not yet currently exist. \r\n\r\nFrom here, I'm going to refer back to the CVE and isolate how it claims that Bitcoin behaves. Then I'm going to point out the protocol specification that states otherwise and explain a bit more how things work in that type of situation. \r\n\r\n### CVE Erroneously Claims That the Child Transaction Should be Replaceable\r\n\r\nSpecifically it states that the unconfirmed child transaction spending an \"unconfirmed parent\" should be replaceable \"because there is inherited signaling by the child transaction.\" \r\n\r\nFrom here, we get the supposed identified CVE, which is the claim that, \"The actual [PreChecks](<file:///home/libre/.ephemeral/Bitcoin/Technical/PreChecks.txt>) implementation does not enforce this. Instead, mempool rejects the replacement attempt of the unconfirmed child transaction.\" \r\n\r\nThis is how the mempool **should** act in this situation. \r\n\r\nSo essentially, they're stating that there can be multiple \"duplicate\" transactions (double spends) in the mempool - which the CVE identifies as incorrect behavior. This oversight is understandable since this is how it would **usually work**. \r\n\r\nBut as we'll see in the next section from 'Mastering Bitcoin', that this specific situation actually triggers an exception in the protocol that dictates special handling. \r\n\r\n### Bitcoin is Supposed to Behave This Way\r\n\r\nDon't ask me how I know this, but this exact situation is actually outlined in, 'Mastering Bitcoin' (really), where it is confirmed that this is how Bitcoin is supposed to behave. \r\n\r\nHere's the link: <<https://www.oreilly.com/library/view/mastering-bitcoin/9781491902639/ch05.html>>\r\n\r\n**Specifically, it says**:\r\n\r\n> \"When a chain of transactions is transmitted across the network, they don't always arrive in the same order. Sometimes, the child might arrive before the parent. In that case, the nodes that see a child first can see that it references a parent transaction that is not yet known.\"\r\n\r\nIn other words, that child transaction is referencing an unconfirmed parent...same situation as described in the CVE. \r\n\r\n**The chapter goes on to state**: \r\n\r\n> \"Rather than reject the child, they put it in a temporary pool (not the mempool) to await the arrival of its parent and propagate it to every other node. The pool of transactions without parents is known as the orphan transaction pool.\" \r\n\r\nMany people have never heard of the 'orphan transaction pool', but it does indeed exist (for transactions that fit the attributes we described above). \r\n\r\n'Mastering Bitcoin' wraps this section up making it clear that the transaction **does evenutally resolve**: \r\n\r\n> \"Once the parent arrives, any orphans that reference the UTXO created by the parent are released from the pool, revalidated recursively, and then the entire chain of transactions can be included in the transaction pool, ready to be mined in a block.\"\r\n\r\n### Unpacking What We Read Above\r\n\r\nThe most important takeaway from what we read above is that the parent must be spent before the unconfirmed child - but if we're in a situation where the child refers to an unconfirmed parent that is referenced as an otherwise valid input, then any 'double spend attempts' that also reference the same (unconfirmed) parent transaction will **not be ousted from the mempool** in the same way that a double spend referencing a **confirmed** parent transaction would.\r\n\r\nBeyond this, its also worth remembering that **this does not mean that the parent must already be confirmed before the child** (confusing, I know - stick with me). \r\n\r\n#### Explaining a Bit Further\r\n\r\nWhenever a new block is submitted by miners, they typically contain a ton of transactions, right? While the order of the TXs doesn't matter, **there is an order to those TXs**. So a miner **can** mine a valid block that contains a previously unspent parent transaction **and** its unspent child. \r\n\r\nThe only caveat is that the parent must be included **before** the child transaction, canonically, within that block.\r\n\r\n### When Parent is Spent, All Duplicates are Immediately Purged\r\n\r\nOnce nodes receive a block that validly spends the parent TX, the normal rules for handling attempted double-spend unconfirmed transactions kick in. So all transactions in the \"orphan transaction pool\" that attempted to spend that same unspent child transaction (whose parent and/or itself just got confirmed) will be expelled by nodes since this is now an unequivocal flagrant double spend attempt. \r\n\r\n### Conclusion - CVE Should Be Rescinded\r\n\r\nTo be honest, I'm not sure if this has happened with a CVE (where it was issued, then later retracted). \r\n\r\nI understand why Core came to the conclusion that this was a CVE (never heard of an 'orphan transaction pool' before I read that passage in 'Mastering Bitcoin', but lo and behold it does).\r\n\r\n**Perhaps This is Bullish**\r\n\r\nThis will undoubtedly be great for at least some folks to hear since it will alleviate the stress that some may feel knowing that there was an active CVE for Bitcoin. \r\n\r\n**Flipside** \r\n\r\nWhile the behavior is not incorrect, the conclusions that the developers came to about it being adverse for LN implementation does stand. \r\n\r\nSo this is more of a pyrrhic victory - depends on how one looks at it. \r\n\r\nAt the end of the day nothing about this situation is catastrophic for Bitcoin. I do think that this behavior should be investigated first and studied before unilaterally changing it since we now know that this is not incorrect behavior.\r\n\r\n",
    "user": {
      "login": "Librechain",
      "id": 59129716,
      "node_id": "MDQ6VXNlcjU5MTI5NzE2",
      "avatar_url": "https://avatars.githubusercontent.com/u/59129716?v=4",
      "gravatar_id": "",
      "url": "https://api.github.com/users/Librechain",
      "html_url": "https://github.com/Librechain",
      "followers_url": "https://api.github.com/users/Librechain/followers",
      "following_url": "https://api.github.com/users/Librechain/following%7B/other_user%7D",
      "gists_url": "https://api.github.com/users/Librechain/gists%7B/gist_id%7D",
      "starred_url": "https://api.github.com/users/Librechain/starred%7B/owner%7D%7B/repo%7D",
      "subscriptions_url": "https://api.github.com/users/Librechain/subscriptions",
      "organizations_url": "https://api.github.com/users/Librechain/orgs",
      "repos_url": "https://api.github.com/users/Librechain/repos",
      "events_url": "https://api.github.com/users/Librechain/events%7B/privacy%7D",
      "received_events_url": "https://api.github.com/users/Librechain/received_events",
      "type": "User",
      "site_admin": false
    },
    "labels": [],
    "assignees": [],
    "author_association": "NONE",
    "locked": true,
    "active_lock_reason": "resolved",
    "comments": 4,
    "closed_at": "2021-05-24T10:10:37Z",
    "created_at": "2021-05-23T22:42:57Z",
    "updated_at": "2022-08-18T18:35:59Z"
  },
  "events": [
    {
      "event": "commented",
      "id": 846637385,
      "node_id": "MDEyOklzc3VlQ29tbWVudDg0NjYzNzM4NQ==",
      "url": "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/846637385",
      "actor": {
        "login": "achow101",
        "id": 3782274,
        "node_id": "MDQ6VXNlcjM3ODIyNzQ=",
        "avatar_url": "https://avatars.githubusercontent.com/u/3782274?v=4",
        "gravatar_id": "",
        "url": "https://api.github.com/users/achow101",
        "html_url": "https://github.com/achow101",
        "followers_url": "https://api.github.com/users/achow101/followers",
        "following_url": "https://api.github.com/users/achow101/following%7B/other_user%7D",
        "gists_url": "https://api.github.com/users/achow101/gists%7B/gist_id%7D",
        "starred_url": "https://api.github.com/users/achow101/starred%7B/owner%7D%7B/repo%7D",
        "subscriptions_url": "https://api.github.com/users/achow101/subscriptions",
        "organizations_url": "https://api.github.com/users/achow101/orgs",
        "repos_url": "https://api.github.com/users/achow101/repos",
        "events_url": "https://api.github.com/users/achow101/events%7B/privacy%7D",
        "received_events_url": "https://api.github.com/users/achow101/received_events",
        "type": "User",
        "site_admin": false
      },
      "commit_id": null,
      "commit_url": null,
      "created_at": "2021-05-23T22:58:16Z",
      "updated_at": "2021-05-23T23:05:21Z",
      "author_association": "MEMBER",
      "body": "Mastering Bitcoin is not the definitive protocol documentation. It is descriptive, i.e. it describes what occurs. It is not prescriptive, i.e. it does not say what should occur. The document that is prescriptive in this case is [BIP 125](https://github.com/bitcoin/bips/blob/master/bip-0125.mediawiki). It states:\r\n\r\n> Inherited signaling: Transactions that don't explicitly signal replaceability are replaceable under this policy for as long as any one of their ancestors signals replaceability and remains unconfirmed.\r\n> ...\r\n> 1. The original transactions signal replaceability explicitly or through inheritance as described in the above Summary section.\r\n\r\nTherefore the CVE is not incorrect.\r\n\r\n***\r\n\r\nOrphan transactions are unrelated to this. Orphan transactions are not those that reference unconfirmed parents, they are those that reference unconfirmed parents **that the node has not received yet**. This is a completely different situation where the node is missing information, not that the parent itself is merely unconfirmed.",
      "user": {
        "login": "achow101",
        "id": 3782274,
        "node_id": "MDQ6VXNlcjM3ODIyNzQ=",
        "avatar_url": "https://avatars.githubusercontent.com/u/3782274?v=4",
        "gravatar_id": "",
        "url": "https://api.github.com/users/achow101",
        "html_url": "https://github.com/achow101",
        "followers_url": "https://api.github.com/users/achow101/followers",
        "following_url": "https://api.github.com/users/achow101/following%7B/other_user%7D",
        "gists_url": "https://api.github.com/users/achow101/gists%7B/gist_id%7D",
        "starred_url": "https://api.github.com/users/achow101/starred%7B/owner%7D%7B/repo%7D",
        "subscriptions_url": "https://api.github.com/users/achow101/subscriptions",
        "organizations_url": "https://api.github.com/users/achow101/orgs",
        "repos_url": "https://api.github.com/users/achow101/repos",
        "events_url": "https://api.github.com/users/achow101/events%7B/privacy%7D",
        "received_events_url": "https://api.github.com/users/achow101/received_events",
        "type": "User",
        "site_admin": false
      },
      "html_url": "https://github.com/bitcoin/bitcoin/issues/22028#issuecomment-846637385",
      "issue_url": "https://api.github.com/repos/bitcoin/bitcoin/issues/22028"
    },
    {
      "event": "commented",
      "id": 846644705,
      "node_id": "MDEyOklzc3VlQ29tbWVudDg0NjY0NDcwNQ==",
      "url": "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/846644705",
      "actor": {
        "login": "Librechain",
        "id": 59129716,
        "node_id": "MDQ6VXNlcjU5MTI5NzE2",
        "avatar_url": "https://avatars.githubusercontent.com/u/59129716?v=4",
        "gravatar_id": "",
        "url": "https://api.github.com/users/Librechain",
        "html_url": "https://github.com/Librechain",
        "followers_url": "https://api.github.com/users/Librechain/followers",
        "following_url": "https://api.github.com/users/Librechain/following%7B/other_user%7D",
        "gists_url": "https://api.github.com/users/Librechain/gists%7B/gist_id%7D",
        "starred_url": "https://api.github.com/users/Librechain/starred%7B/owner%7D%7B/repo%7D",
        "subscriptions_url": "https://api.github.com/users/Librechain/subscriptions",
        "organizations_url": "https://api.github.com/users/Librechain/orgs",
        "repos_url": "https://api.github.com/users/Librechain/repos",
        "events_url": "https://api.github.com/users/Librechain/events%7B/privacy%7D",
        "received_events_url": "https://api.github.com/users/Librechain/received_events",
        "type": "User",
        "site_admin": false
      },
      "commit_id": null,
      "commit_url": null,
      "created_at": "2021-05-23T23:44:00Z",
      "updated_at": "2021-05-23T23:44:00Z",
      "author_association": "NONE",
      "body": "Hey Andrew! \n\nWith all due respect, I believe you're wrong on this matter. \n\nWhile MasteringBitcoin [1] does not govern the protocol, the link that I\nsent here not only outlines how the protocol behaves, it also provides\nexcerpts explicitly from the source code (and it is still present\ntoday). \n\nFor a more thorough breakdown of how this facet of Bitcoin behaved,\nplease refer to this (somewhat aged) piece by NCC -\nhttps://cryptoservices.github.io/fde/2018/12/14/bitcoin-orphan-TX-CVE.html\n\n\nAs of right now, the portion of Bitcoin's source code that governs how\norphan transactions are to be handled can be found here:\nhttps://github.com/bitcoin/bitcoin/blob/7fcf53f7b4524572d1d0c9a5fdc388e87eb02416/src/txorphanage.cpp\n\n\n\t* It appears that there were a few measures taken to reduce the risk of\nDDoS [2] (which the CVE also mentions as a risk for some reason despite\nthe existence of this code)\n\n\t* There is an expiry time placed on the orphan transactions\n\n \t* There is a max total # of orphans that any given node will hold\n(100)\n\nOther parts of the Bitcoin source introduce a # of tools that individual\nclients can use to protect themselves from DDoS [2] attempts. \n\nSwitching to another file: \n\nCode explicitly includes: static const unsigned int\nDEFAULT_MAX_ORPHAN_TRANSACTIONS = 100 \n\nThe most informative (and evidential) proof that the behavior the CVE\ndescribes as erroneous is actually indicative of it performing as it\nshould can be found within the code of the 'txorphange' header file. \n\nsource:\nhttps://github.com/bitcoin/bitcoin/blob/7fcf53f7b4524572d1d0c9a5fdc388e87eb02416/src/txorphanage.h\n\n\nIf we head to line 46 in the header file, the code notes state, \"Add any\norphans that list a particular tx as a parent into a peer's work set (ie\norphans that may have found their final missing parent, and so should be\nreconsidered for the mempool)\". \n\nAnother file in the Bitcoin source that outlines the instantiation of\nthe 'orphan pool' here (Doxygen):\nhttps://doxygen.bitcoincore.org/txorphanage_8cpp_source.html \n\nThere is nothing that I can see anywhere in the source code that\nstipulates that t \n\nLinks:\n------\n[1] file:///home/libre/.ephemeral/Bitcoin/Technical/MasteringBitcoin.txt\n[2] file:///home/libre/.ephemeral/Bitcoin/Technical/DDoS.txt",
      "user": {
        "login": "Librechain",
        "id": 59129716,
        "node_id": "MDQ6VXNlcjU5MTI5NzE2",
        "avatar_url": "https://avatars.githubusercontent.com/u/59129716?v=4",
        "gravatar_id": "",
        "url": "https://api.github.com/users/Librechain",
        "html_url": "https://github.com/Librechain",
        "followers_url": "https://api.github.com/users/Librechain/followers",
        "following_url": "https://api.github.com/users/Librechain/following%7B/other_user%7D",
        "gists_url": "https://api.github.com/users/Librechain/gists%7B/gist_id%7D",
        "starred_url": "https://api.github.com/users/Librechain/starred%7B/owner%7D%7B/repo%7D",
        "subscriptions_url": "https://api.github.com/users/Librechain/subscriptions",
        "organizations_url": "https://api.github.com/users/Librechain/orgs",
        "repos_url": "https://api.github.com/users/Librechain/repos",
        "events_url": "https://api.github.com/users/Librechain/events%7B/privacy%7D",
        "received_events_url": "https://api.github.com/users/Librechain/received_events",
        "type": "User",
        "site_admin": false
      },
      "html_url": "https://github.com/bitcoin/bitcoin/issues/22028#issuecomment-846644705",
      "issue_url": "https://api.github.com/repos/bitcoin/bitcoin/issues/22028"
    },
    {
      "event": "commented",
      "id": 846646699,
      "node_id": "MDEyOklzc3VlQ29tbWVudDg0NjY0NjY5OQ==",
      "url": "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/846646699",
      "actor": {
        "login": "achow101",
        "id": 3782274,
        "node_id": "MDQ6VXNlcjM3ODIyNzQ=",
        "avatar_url": "https://avatars.githubusercontent.com/u/3782274?v=4",
        "gravatar_id": "",
        "url": "https://api.github.com/users/achow101",
        "html_url": "https://github.com/achow101",
        "followers_url": "https://api.github.com/users/achow101/followers",
        "following_url": "https://api.github.com/users/achow101/following%7B/other_user%7D",
        "gists_url": "https://api.github.com/users/achow101/gists%7B/gist_id%7D",
        "starred_url": "https://api.github.com/users/achow101/starred%7B/owner%7D%7B/repo%7D",
        "subscriptions_url": "https://api.github.com/users/achow101/subscriptions",
        "organizations_url": "https://api.github.com/users/achow101/orgs",
        "repos_url": "https://api.github.com/users/achow101/repos",
        "events_url": "https://api.github.com/users/achow101/events%7B/privacy%7D",
        "received_events_url": "https://api.github.com/users/achow101/received_events",
        "type": "User",
        "site_admin": false
      },
      "commit_id": null,
      "commit_url": null,
      "created_at": "2021-05-23T23:56:22Z",
      "updated_at": "2021-05-23T23:56:22Z",
      "author_association": "MEMBER",
      "body": "It is not clear to me how CVE-2021-31876 is related to orphan transactions at all, or why you think that orphan transactions are related to this CVE. The email to the bitcoin-dev mailing list describing this issue does not mention orphan txs at all.\r\n\r\nThe CVE merely describes how Bitcoin Core's RBF implementation is not consistent with the specification described with BIP 125. This statement is correct. The [submitter](https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2021-May/018924.html) agrees that this is not a vulnerability in Core per se, but rather it is a missing behavior in Core that other software have been relying on, and so those software may be vulnerable.",
      "user": {
        "login": "achow101",
        "id": 3782274,
        "node_id": "MDQ6VXNlcjM3ODIyNzQ=",
        "avatar_url": "https://avatars.githubusercontent.com/u/3782274?v=4",
        "gravatar_id": "",
        "url": "https://api.github.com/users/achow101",
        "html_url": "https://github.com/achow101",
        "followers_url": "https://api.github.com/users/achow101/followers",
        "following_url": "https://api.github.com/users/achow101/following%7B/other_user%7D",
        "gists_url": "https://api.github.com/users/achow101/gists%7B/gist_id%7D",
        "starred_url": "https://api.github.com/users/achow101/starred%7B/owner%7D%7B/repo%7D",
        "subscriptions_url": "https://api.github.com/users/achow101/subscriptions",
        "organizations_url": "https://api.github.com/users/achow101/orgs",
        "repos_url": "https://api.github.com/users/achow101/repos",
        "events_url": "https://api.github.com/users/achow101/events%7B/privacy%7D",
        "received_events_url": "https://api.github.com/users/achow101/received_events",
        "type": "User",
        "site_admin": false
      },
      "html_url": "https://github.com/bitcoin/bitcoin/issues/22028#issuecomment-846646699",
      "issue_url": "https://api.github.com/repos/bitcoin/bitcoin/issues/22028"
    },
    {
      "event": "commented",
      "id": 846937892,
      "node_id": "MDEyOklzc3VlQ29tbWVudDg0NjkzNzg5Mg==",
      "url": "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/846937892",
      "actor": {
        "login": "MarcoFalke",
        "id": 6399679,
        "node_id": "MDQ6VXNlcjYzOTk2Nzk=",
        "avatar_url": "https://avatars.githubusercontent.com/u/6399679?v=4",
        "gravatar_id": "",
        "url": "https://api.github.com/users/MarcoFalke",
        "html_url": "https://github.com/MarcoFalke",
        "followers_url": "https://api.github.com/users/MarcoFalke/followers",
        "following_url": "https://api.github.com/users/MarcoFalke/following%7B/other_user%7D",
        "gists_url": "https://api.github.com/users/MarcoFalke/gists%7B/gist_id%7D",
        "starred_url": "https://api.github.com/users/MarcoFalke/starred%7B/owner%7D%7B/repo%7D",
        "subscriptions_url": "https://api.github.com/users/MarcoFalke/subscriptions",
        "organizations_url": "https://api.github.com/users/MarcoFalke/orgs",
        "repos_url": "https://api.github.com/users/MarcoFalke/repos",
        "events_url": "https://api.github.com/users/MarcoFalke/events%7B/privacy%7D",
        "received_events_url": "https://api.github.com/users/MarcoFalke/received_events",
        "type": "User",
        "site_admin": false
      },
      "commit_id": null,
      "commit_url": null,
      "created_at": "2021-05-24T10:10:37Z",
      "updated_at": "2021-05-24T10:10:37Z",
      "author_association": "MEMBER",
      "body": "Thanks everyone for your thoughtful input. I am going to close this issue for now, but please feel free to continue the discussion in this thread.",
      "user": {
        "login": "MarcoFalke",
        "id": 6399679,
        "node_id": "MDQ6VXNlcjYzOTk2Nzk=",
        "avatar_url": "https://avatars.githubusercontent.com/u/6399679?v=4",
        "gravatar_id": "",
        "url": "https://api.github.com/users/MarcoFalke",
        "html_url": "https://github.com/MarcoFalke",
        "followers_url": "https://api.github.com/users/MarcoFalke/followers",
        "following_url": "https://api.github.com/users/MarcoFalke/following%7B/other_user%7D",
        "gists_url": "https://api.github.com/users/MarcoFalke/gists%7B/gist_id%7D",
        "starred_url": "https://api.github.com/users/MarcoFalke/starred%7B/owner%7D%7B/repo%7D",
        "subscriptions_url": "https://api.github.com/users/MarcoFalke/subscriptions",
        "organizations_url": "https://api.github.com/users/MarcoFalke/orgs",
        "repos_url": "https://api.github.com/users/MarcoFalke/repos",
        "events_url": "https://api.github.com/users/MarcoFalke/events%7B/privacy%7D",
        "received_events_url": "https://api.github.com/users/MarcoFalke/received_events",
        "type": "User",
        "site_admin": false
      },
      "html_url": "https://github.com/bitcoin/bitcoin/issues/22028#issuecomment-846937892",
      "issue_url": "https://api.github.com/repos/bitcoin/bitcoin/issues/22028"
    },
    {
      "event": "closed",
      "id": 4785872988,
      "node_id": "MDExOkNsb3NlZEV2ZW50NDc4NTg3Mjk4OA==",
      "url": "https://api.github.com/repos/bitcoin/bitcoin/issues/events/4785872988",
      "actor": {
        "login": "MarcoFalke",
        "id": 6399679,
        "node_id": "MDQ6VXNlcjYzOTk2Nzk=",
        "avatar_url": "https://avatars.githubusercontent.com/u/6399679?v=4",
        "gravatar_id": "",
        "url": "https://api.github.com/users/MarcoFalke",
        "html_url": "https://github.com/MarcoFalke",
        "followers_url": "https://api.github.com/users/MarcoFalke/followers",
        "following_url": "https://api.github.com/users/MarcoFalke/following%7B/other_user%7D",
        "gists_url": "https://api.github.com/users/MarcoFalke/gists%7B/gist_id%7D",
        "starred_url": "https://api.github.com/users/MarcoFalke/starred%7B/owner%7D%7B/repo%7D",
        "subscriptions_url": "https://api.github.com/users/MarcoFalke/subscriptions",
        "organizations_url": "https://api.github.com/users/MarcoFalke/orgs",
        "repos_url": "https://api.github.com/users/MarcoFalke/repos",
        "events_url": "https://api.github.com/users/MarcoFalke/events%7B/privacy%7D",
        "received_events_url": "https://api.github.com/users/MarcoFalke/received_events",
        "type": "User",
        "site_admin": false
      },
      "commit_id": null,
      "commit_url": null,
      "created_at": "2021-05-24T10:10:37Z"
    },
    {
      "event": "locked",
      "id": 7216608440,
      "node_id": "LOE_lADOABII5841l5AmzwAAAAGuJLS4",
      "url": "https://api.github.com/repos/bitcoin/bitcoin/issues/events/7216608440",
      "actor": {
        "login": "DrahtBot",
        "id": 39886733,
        "node_id": "MDQ6VXNlcjM5ODg2NzMz",
        "avatar_url": "https://avatars.githubusercontent.com/u/39886733?v=4",
        "gravatar_id": "",
        "url": "https://api.github.com/users/DrahtBot",
        "html_url": "https://github.com/DrahtBot",
        "followers_url": "https://api.github.com/users/DrahtBot/followers",
        "following_url": "https://api.github.com/users/DrahtBot/following%7B/other_user%7D",
        "gists_url": "https://api.github.com/users/DrahtBot/gists%7B/gist_id%7D",
        "starred_url": "https://api.github.com/users/DrahtBot/starred%7B/owner%7D%7B/repo%7D",
        "subscriptions_url": "https://api.github.com/users/DrahtBot/subscriptions",
        "organizations_url": "https://api.github.com/users/DrahtBot/orgs",
        "repos_url": "https://api.github.com/users/DrahtBot/repos",
        "events_url": "https://api.github.com/users/DrahtBot/events%7B/privacy%7D",
        "received_events_url": "https://api.github.com/users/DrahtBot/received_events",
        "type": "User",
        "site_admin": false
      },
      "commit_id": null,
      "commit_url": null,
      "created_at": "2022-08-18T18:35:59Z",
      "lock_reason": "resolved"
    }
  ]
}