{
  "type": "issue",
  "issue": {
    "id": 2889111550,
    "node_id": "I_kwDOABII586sNFf-",
    "url": "https://api.github.com/repos/bitcoin/bitcoin/issues/31970",
    "repository_url": "https://api.github.com/repos/bitcoin/bitcoin",
    "labels_url": "https://api.github.com/repos/bitcoin/bitcoin/issues/31970/labels%7B/name%7D",
    "comments_url": "https://api.github.com/repos/bitcoin/bitcoin/issues/31970/comments",
    "events_url": "https://api.github.com/repos/bitcoin/bitcoin/issues/31970/events",
    "html_url": "https://github.com/bitcoin/bitcoin/issues/31970",
    "number": 31970,
    "state": "open",
    "state_reason": null,
    "title": "Bitcoin Core MacOS - Possible Miner Infection - Bitcoin Core MacOS - Possível Infecção por Minerador",
    "body": "### Is there an existing issue for this?\n\n- [x] I have searched the existing issues\n\n### Current behaviour\n\n🇺🇸\n\nSubject: 🚨 Bitcoin Core for MacOS - Possible Miner Infection 🚨\n\nDear Bitcoin Core developers,\n\nI downloaded the Bitcoin Core software directly from the official website (bitcoincore.org) for macOS, and my antivirus detected a possible malware embedded in the program.\n\nAvast identified the file as MacOS:Miner-AR [PUP], and after checking on VirusTotal, several other antivirus programs also flagged the software as a potential miner.\n\nTo prevent other users from being affected, I would like to confirm if there is any official explanation for this. Could the downloaded file be compromised?\n\nI have attached screenshots of the VirusTotal and Avast analysis for your review.\n\nI look forward to your response. Thank you!\n\n![Image](https://github.com/user-attachments/assets/9145f3ff-d1f2-4d48-b197-c62f17ae1726)\n![Image](https://github.com/user-attachments/assets/41404786-df72-4358-bfac-59c86bcf8d94)\n\n\n\n🇧🇷\n\nAssunto: 🚨 Bitcoin Core para MacOS - Possível Infecção por Minerador 🚨\n\nPrezados desenvolvedores do Bitcoin Core,\n\nBaixei o software Bitcoin Core diretamente do site oficial (bitcoincore.org) para macOS, e meu antivírus detectou um possível malware embutido no programa.\n\nO Avast identificou o arquivo como MacOS:Miner-AR [PUP], e ao verificar no VirusTotal, diversos outros antivírus também sinalizaram o software como um possível minerador.\n\nPara evitar que outros usuários sejam afetados, gostaria de confirmar se há alguma explicação oficial sobre isso. O arquivo baixado pode estar comprometido?\n\nAnexei prints da análise do VirusTotal e do Avast para facilitar a verificação.\n\nFico no aguardo de um retorno. Obrigado!\n\n\n\n\n### Expected behaviour\n\n\n“I expected the Bitcoin Core installation file to be clean and free of any malware or suspicious activities. However, my antivirus detected a miner (MacOS:Miner-AR [PUP]), and a VirusTotal scan confirmed multiple detections from different security vendors. I would like to understand if this is a false positive or if the file has been compromised.”\n\n“Eu esperava que o arquivo de instalação do Bitcoin Core estivesse limpo e livre de qualquer malware ou atividades suspeitas. No entanto, meu antivírus detectou um minerador (MacOS:Miner-AR [PUP]), e a verificação no VirusTotal confirmou múltiplas detecções de diferentes fornecedores de segurança. Gostaria de entender se isso é um falso positivo ou se o arquivo foi comprometido.”\n\n### Steps to reproduce\n\n\n\t1.\tDownloaded the Bitcoin Core installation file from the official website.\n\t2.\tScanned the file with Avast antivirus, which flagged it as containing MacOS:Miner-AR [PUP].\n\t3.\tUploaded the file to VirusTotal, where 8 out of 59 security vendors flagged it as malicious.\n\t4.\tThe detected threat is classified as a miner, potentially compromising system performance and security.\n\t5.\tSeeking clarification on whether this is a false positive or if the file has been compromised.\n\n\n\t1.\tBaixei o arquivo de instalação do Bitcoin Core a partir do site oficial.\n\t2.\tFiz uma varredura com o antivírus Avast, que detectou a ameaça MacOS:Miner-AR [PUP].\n\t3.\tEnviei o arquivo para o VirusTotal, onde 8 de 59 fornecedores de segurança o marcaram como malicioso.\n\t4.\tA ameaça detectada foi classificada como um minerador, o que pode comprometer o desempenho e a segurança do sistema.\n\t5.\tBusco esclarecimentos sobre se isso é um falso positivo ou se o arquivo foi comprometido.\n\n\n### Relevant log output\n\n_No response_\n\n### How did you obtain Bitcoin Core\n\nOther\n\n### What version of Bitcoin Core are you using?\n\nBitcoin Core 28.1\n\n### Operating system and version\n\nmacOS Sequoia 15.3.1 (Apple M2, MacBook Air 2022)\n\n### Machine specifications\n\n_No response_",
    "user": {
      "login": "RodrigoCamposDS",
      "id": 186061287,
      "node_id": "U_kgDOCxcR5w",
      "avatar_url": "https://avatars.githubusercontent.com/u/186061287?v=4",
      "gravatar_id": "",
      "url": "https://api.github.com/users/RodrigoCamposDS",
      "html_url": "https://github.com/RodrigoCamposDS",
      "followers_url": "https://api.github.com/users/RodrigoCamposDS/followers",
      "following_url": "https://api.github.com/users/RodrigoCamposDS/following%7B/other_user%7D",
      "gists_url": "https://api.github.com/users/RodrigoCamposDS/gists%7B/gist_id%7D",
      "starred_url": "https://api.github.com/users/RodrigoCamposDS/starred%7B/owner%7D%7B/repo%7D",
      "subscriptions_url": "https://api.github.com/users/RodrigoCamposDS/subscriptions",
      "organizations_url": "https://api.github.com/users/RodrigoCamposDS/orgs",
      "repos_url": "https://api.github.com/users/RodrigoCamposDS/repos",
      "events_url": "https://api.github.com/users/RodrigoCamposDS/events%7B/privacy%7D",
      "received_events_url": "https://api.github.com/users/RodrigoCamposDS/received_events",
      "type": "User",
      "site_admin": false,
      "patch_url": null
    },
    "labels": [],
    "assignees": [],
    "author_association": "NONE",
    "locked": false,
    "comments": 0,
    "created_at": "2025-03-01T19:38:12Z",
    "updated_at": "2025-03-01T19:38:12Z"
  },
  "events": []
}