{
  "type": "issue",
  "issue": {
    "id": 3826622158,
    "node_id": "I_kwDOABII587kFZ7O",
    "url": "https://api.github.com/repos/bitcoin/bitcoin/issues/34330",
    "repository_url": "https://api.github.com/repos/bitcoin/bitcoin",
    "labels_url": "https://api.github.com/repos/bitcoin/bitcoin/issues/34330/labels%7B/name%7D",
    "comments_url": "https://api.github.com/repos/bitcoin/bitcoin/issues/34330/comments",
    "events_url": "https://api.github.com/repos/bitcoin/bitcoin/issues/34330/events",
    "html_url": "https://github.com/bitcoin/bitcoin/issues/34330",
    "number": 34330,
    "state": "open",
    "state_reason": null,
    "title": "Contributor Retention and Participation Metrics in Bitcoin Core (Project Health Observability)",
    "body": "Note: I’m approaching this from a research and analysis perspective rather than as a code contributor.\n\nThis issue shares descriptive, non-normative metrics related to contributor retention and participation patterns in the Bitcoin Core repository, derived from publicly observable GitHub activity over time.\n\nLong-lived open-source projects commonly track indicators such as review latency, bus factor, CI reliability, and test coverage. Contributor retention and participation depth are complementary project-health signals, particularly for repositories with high review load and long-lived maintenance requirements.\n\nRecent longitudinal analysis of participation data suggests:\nA large fraction of historical participants become inactive within a year of their last recorded activity.\nLong-term active contributors represent a small fraction of total historical participants.\nHigh exit rates are observable even among contributors whose pull requests were frequently merged.\n\nThese observations are purely descriptive and do not assert intent, motivation, or off-repository contribution. “Inactive” refers only to the absence of observable GitHub activity within a defined time window.\n\nThis issue does not propose:\nChanges to Bitcoin Core policy or consensus rules\nModifications to maintainership or decision authority\nNormative claims about how governance should function\n\nThe purpose is limited to:\n1. Assessing whether retention and participation metrics are useful additions to existing project-health observability.\n2. Determining if existing tooling already captures these signals adequately, or if gaps exist.\n3. Enabling reproducible discussion around contributor lifecycle dynamics that may affect review capacity, onboarding, and long-term maintenance load.\n\nIf this repository considers contributor retention metrics out of scope, that clarification would itself be useful for aligning expectations around which project-health signals are tracked here versus elsewhere.\n\nMethodology, assumptions, and raw aggregation logic can be shared or adjusted for comparison if helpful.\nThank you.",
    "user": {
      "login": "Conrad8910",
      "id": 156716749,
      "node_id": "U_kgDOCVdOzQ",
      "avatar_url": "https://avatars.githubusercontent.com/u/156716749?v=4",
      "gravatar_id": "",
      "url": "https://api.github.com/users/Conrad8910",
      "html_url": "https://github.com/Conrad8910",
      "followers_url": "https://api.github.com/users/Conrad8910/followers",
      "following_url": "https://api.github.com/users/Conrad8910/following%7B/other_user%7D",
      "gists_url": "https://api.github.com/users/Conrad8910/gists%7B/gist_id%7D",
      "starred_url": "https://api.github.com/users/Conrad8910/starred%7B/owner%7D%7B/repo%7D",
      "subscriptions_url": "https://api.github.com/users/Conrad8910/subscriptions",
      "organizations_url": "https://api.github.com/users/Conrad8910/orgs",
      "repos_url": "https://api.github.com/users/Conrad8910/repos",
      "events_url": "https://api.github.com/users/Conrad8910/events%7B/privacy%7D",
      "received_events_url": "https://api.github.com/users/Conrad8910/received_events",
      "type": "User",
      "site_admin": false,
      "name": null,
      "patch_url": null
    },
    "labels": [],
    "assignees": [],
    "author_association": "NONE",
    "locked": false,
    "comments": 0,
    "created_at": "2026-01-18T10:41:47Z",
    "updated_at": "2026-01-18T10:41:47Z"
  },
  "events": []
}